1c/Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>POP3Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPАутентификация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/Catalogs/УчетныеЗаписиЭлектроннойПочты/Ext/ManagerModule.bsl
Функция СформироватьИнтернетПрофиль(УчетнаяЗаписьЭлектроннойПочты) Экспорт
	
	//сделал для теста gmail
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	профиль.ПортSMTP     =УчетнаяЗаписьЭлектроннойПочты.ПортSMTP;
	профиль.POP3ПередSMTP    =Ложь;
	профиль.АдресСервераIMAP    ="";
	профиль.АдресСервераPOP3    ="";
	профиль.АдресСервераSMTP=    УчетнаяЗаписьЭлектроннойПочты.SMTPСервер; 
	профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;
	профиль.ИспользоватьSSLIMAP    = Ложь;
	профиль.ИспользоватьSSLPOP3    = Ложь;
	профиль.ИспользоватьSSLSMTP    = Истина;
	профиль.Пароль    =УчетнаяЗаписьЭлектроннойПочты.Пароль;
	профиль.ПарольIMAP    ="";
	профиль.ПарольSMTP    = УчетнаяЗаписьЭлектроннойПочты.Пароль;
	профиль.Пользователь    =УчетнаяЗаписьЭлектроннойПочты.Логин; 
	профиль.ПользовательIMAP    ="";
	профиль.ПользовательSMTP =    УчетнаяЗаписьЭлектроннойПочты.Логин;
	профиль.ПортIMAP    =0;
	профиль.ПортPOP3=    0;
	профиль.Таймаут    = 60;
	профиль.ТолькоЗащищеннаяАутентификацияIMAP    =Ложь;
	профиль.ТолькоЗащищеннаяАутентификацияPOP3    =Ложь;
	профиль.ТолькоЗащищеннаяАутентификацияSMTP    =Ложь;
	Возврат Профиль;
	
	
	
КонецФункции
